/*
A=D
B=D
C=D?

 - 귀납 induction
  < 전제의 주장을 넘어 지식을 확장시키는데 목적이 있다. >
  < 어느정도 논리의 비약을 허용한다. >
  < 귀납법 만으로는 개연성 있는 가설을 만들 뿐이지 논리적 필연성을 갖진 못한다. >
 */
export const Induction = (
    principle,
    example,
    result
) => {

    /*
    사례1= 길가의 고양이는 츄르를 좋아한다.
    사례2= 옆집의 고양이는 츄르를 좋아한다.
    추론 = 모든 고양이는 츄르를 좋아할 것이다.
     */

    /*
    결과가 맞지 않는다면.
    1. 사례에 조건이 부족하거나
    2. 잘못된 사례이거나
    3. 잘못된 원칙이거나

    사례에 조건 추가
    사실2+= 생명체는 (영양분이 부족할때) 밥을 먹는다.
    사실2+= 생명체는 (영양분이 과도하게 소비되기 전) 밥을 먹는다.
     */
}